# Дан сприсок чисел. Определите, сколько в нем встречается различных чисел.
# [1, 1, 2, 0, -1, 3, 4, 4]

a = [1, 1, 2, 0, -1, 3, 4, 4]

print(len(set(a)))